# GetBoundingBox Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Face..::..GetBoundingBox Method
Face Class See Also
---
Returns the UV bounding box of the face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public BoundingBoxUV GetBoundingBox()
```

Visual Basic
---
```text
Public Function GetBoundingBox As BoundingBoxUV
```

Visual C++
---
```text
public:
BoundingBoxUV^ GetBoundingBox()
```

# ### Return Value
A BoundingBoxUV with the extents of the parameterization of the face.
# See Also
Face Class
Autodesk.Revit.DB Namespace